tnt310/STM32-E407-ETHERNET-MODBUS-MASTER/Src/modbus_mqtt_bridge.c
		}
//		vTaskDelay(10);

	}
}
//	how to got mqtt intance??
/*-------------------------------------PROVISION DOWNSTREAM AND COMMAND DOWNSTREAM---------------------------------------------------------------------------------------*/
uint8_t mqtt_modbus_thread_down_provision(char *Buffer,uint16_t BufferLen) {

		//printf("\r\n NUMBER OF DEVICE: %d\r\n",num_device);
		uint8_t  deviceID ,channelStatus;
		uint16_t channel_id;
		int r;
		jsmn_parser p;
		jsmntok_t t[JSON_MAX_LEN]; /* We exect no morep than JSON_MAX_LEN tokens */
		jsmn_init(&p);
		r = jsmn_parse(&p, Buffer, BufferLen, t,sizeof(t) / sizeof(t[0]));
		//printf("\r\n r value: %d\r\n", r);
		if (r < 0) {
			printf("Failed to parse JSON: %d\n", r);
			return 1;
		}
		if (r < 1 || t[0].type != JSMN_OBJECT) {
			printf("Object expected\n");
			return 1;
		}
		for (uint8_t i = 0; i < r-1; i++) {
			printf("\r\n -value: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
//			if (i == 2){
//				deviceID = atoi(Buffer + t[i + 1].start);
//			}else if (i == 5){
//				//printf("\r\n - channelID: %.*s\r\n", t[i + 1].end - t[i + 1].start,Buffer + t[i + 1].start);
//			}
//			else if ( i == 6){
//				for (uint8_t j = i; j < r-1; j++){
//					if(j % 2 == 0){
//						channel_id = atoi(Buffer + t[j + 1].start);
//					}
//					else if (j %2 != 0){
//						channelStatus = atoi(Buffer + t[j + 1].start);
//						for (uint8_t m = 0; m < num_device; m++){
//							if( (dynamic+m)->deviceID == deviceID && (dynamic+m)->deviceChannel == channel_id){
//								//(dynamic+m)->devicestatus = channelStatus;
//								printf("\r\n - deviceID %d \t channelID: %d \t channelstatus: %d\r\n",deviceID,channel_id,channelStatus);
//							}
//						}
//					}
//				}
//			}

		}
}
uint8_t mqtt_modbus_thread_down_command(char *pJsonMQTTBuffer,uint16_t pJsonMQTTBufferLen) {

		int r;
		jsmn_parser p;
		jsmntok_t t[JSON_MAX_LEN]; /* We expect no more than JSON_MAX_LEN tokens */
		jsmn_init(&p);
		xQueueMbMqtt_t xQueueMbMqtt;
		r = jsmn_parse(&p, pJsonMQTTBuffer, pJsonMQTTBufferLen, t,sizeof(t) / sizeof(t[0]));
		if (r < 0) {
			printf("Failed to parse JSON: %d\n", r);
			return 1;
		}

		/* Assume the top-level element is an object */
		if (r < 1 || t[0].type != JSMN_OBJECT) {
			printf("Object expected\n");
			return 1;
		}
		for (uint8_t i = 1; i < r; i++) {
			if (jsoneq(pJsonMQTTBuffer, &t[i], "device_id") == 0) {
				printf("\r\n - device_id: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				xQueueMbMqtt.NodeID = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			}
			else if (jsoneq(pJsonMQTTBuffer, &t[i], "channel_id") == 0) {
				printf("\r\n - channel_id: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				xQueueMbMqtt.RegAdr.i16data = atoi(pJsonMQTTBuffer + t[i + 1].start);
				i++;
			}
			else if (jsoneq(pJsonMQTTBuffer, &t[i], "command") == 0) {
				uint8_t command = 0;
				char cmd[20];
				printf("\r\n - command: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				strncpy(cmd, pJsonMQTTBuffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
				if (strstr(cmd,"read") != NULL){
					command = 3;
					uint16_t value = 1;
					xQueueMbMqtt.RegData.i8data[0] = (uint8_t)value;
					xQueueMbMqtt.RegData.i8data[1] = (uint8_t)(value >> 8);
				}
				else if (strstr(cmd,"write") != NULL)
					command = 6;
				xQueueMbMqtt.FunC = command;
				i++;
			}
			else if (jsoneq(pJsonMQTTBuffer, &t[i], "value") == 0) {
				uint16_t value = 0;
				char val[10];
				printf("\r\n - value: %.*s\n", t[i + 1].end - t[i + 1].start,pJsonMQTTBuffer + t[i + 1].start);
				strncpy(val, pJsonMQTTBuffer + t[i + 1].start, t[i + 1].end - t[i + 1].start);
				if (strstr(val,"true") != NULL || strstr(val,"on") != NULL)
					value = 1;
				else if (strstr(val,"false") != NULL || strstr(val,"off") != NULL)
					value = 0;
				else
					value = atoi(pJsonMQTTBuffer + t[i + 1].start);
				xQueueMbMqtt.RegData.i8data[0] = (uint8_t)value;
				xQueueMbMqtt.RegData.i8data[1] = (uint8_t)(value >> 8);
				i++;
			}
		}
		BaseType_t Err = pdFALSE;
		Err = xQueueSend(xQueueDownlinkHandle, &xQueueMbMqtt,portDEFAULT_WAIT_TIME);
		if (Err == pdPASS) {
			memset(pJsonMQTTBuffer,'\0',pJsonMQTTBufferLen);
		} else {
			printf("\r\n Modbus_MQTT Downlink queued: False \r\n");
		}
}

